#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_dynamodb_table.bottles-table: Refreshing state... [id=Bottles]
aws_iam_role.bottel-dynamodb-role: Refreshing state... [id=bottel-dynamodb-role]
aws_s3_bucket.cdn_bucket: Refreshing state... [id=bottel-cdn]
aws_cognito_user_pool.bottel-user-pool: Refreshing state... [id=us-east-1_K7Gqshcfu]
aws_cognito_user_pool_client.client: Refreshing state... [id=ogelnad7b8tnefcl1ds1cf31s]
aws_appsync_graphql_api.bottel-api: Refreshing state... [id=3t5rpj5s2rd5vcjek3627sxmeq]
aws_iam_role_policy.bottel-dynamodb-policy: Refreshing state... [id=bottel-dynamodb-role:bottel-dynamodb-policy]
aws_appsync_datasource.bottles-datasource: Refreshing state... [id=3t5rpj5s2rd5vcjek3627sxmeq-bottles_datasource]
aws_appsync_resolver.getBottle-resolver: Refreshing state... [id=3t5rpj5s2rd5vcjek3627sxmeq-Query-getBottle]
aws_appsync_resolver.listBottles-resolver: Refreshing state... [id=3t5rpj5s2rd5vcjek3627sxmeq-Query-listBottles]
aws_appsync_resolver.deleteBottle-resolver: Refreshing state... [id=3t5rpj5s2rd5vcjek3627sxmeq-Mutation-deleteBottle]
aws_appsync_resolver.createBottle-resolver: Refreshing state... [id=3t5rpj5s2rd5vcjek3627sxmeq-Mutation-createBottle]
aws_appsync_resolver.updateBottle-resolver: Refreshing state... [id=3t5rpj5s2rd5vcjek3627sxmeq-Mutation-updateBottle]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cognito_user_pool.bottel-user-pool has changed
  ~ resource "aws_cognito_user_pool" "bottel-user-pool" {
        id                        = "us-east-1_K7Gqshcfu"
        name                      = "bottel-user-pool"
      + tags                      = {}
        # (8 unchanged attributes hidden)





      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "email"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "0"
            }
        }
      - schema {
          - attribute_data_type = "String" -> null
          - name                = "email" -> null
          - required            = true -> null

          - string_attribute_constraints {
              - max_length = "256" -> null
              - min_length = "0" -> null
            }
        }


        # (6 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.client has changed
  ~ resource "aws_cognito_user_pool_client" "client" {
      + allowed_oauth_flows                  = []
      + allowed_oauth_scopes                 = []
      + explicit_auth_flows                  = []
        id                                   = "ogelnad7b8tnefcl1ds1cf31s"
        name                                 = "bottel-client"
      + read_attributes                      = []
      + supported_identity_providers         = []
      + write_attributes                     = []
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cognito_user_pool.bottel-user-pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "bottel-user-pool" {
      ~ auto_verified_attributes  = [
          - "email",
          + "phone_number",
        ]
        id                        = "us-east-1_K7Gqshcfu"
        name                      = "bottel-user-pool"
        tags                      = {}
        # (7 unchanged attributes hidden)





      - schema {
          - attribute_data_type      = "String" -> null
          - developer_only_attribute = false -> null
          - mutable                  = false -> null
          - name                     = "email" -> null
          - required                 = true -> null

          - string_attribute_constraints {
              - max_length = "256" -> null
              - min_length = "0" -> null
            }
        }
      + schema {
          + attribute_data_type = "String"
          + name                = "phone_number"
          + required            = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "0"
            }
        }

      + sms_configuration {
          + sns_caller_arn = (known after apply)
        }


        # (6 unchanged blocks hidden)
    }

  # aws_iam_role.bottel-sns-caller-role will be created
  + resource "aws_iam_role" "bottel-sns-caller-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "stsAssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + sts:ExternalId = ""
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cognito-idp.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bottel-sns-caller-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.bottel-sns-caller-policy will be created
  + resource "aws_iam_role_policy" "bottel-sns-caller-policy" {
      + id     = (known after apply)
      + name   = "bottel-sns-caller-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sns:publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>